{ "_id" : { "$oid" : "52013669116a1468585641d2" }, "name" : "Exposure to new technologies", "reason" : "Working at HubSpot, you'll be exposed to the whole universe of cutting-edge technologies and tools.  We use Python, Java, and NodeJS extensively, and build our services on top of both relational and key-value data stores.  We use the public cloud, we use the private cloud, and we run on hardware.  If there's an area of Software-as-a-Service operations that you're interested in, HubSpot is a place that can provide an opportunity to learn it." }
{ "_id" : { "$oid" : "520137e2116a1468585641d3" }, "name" : "Career growth opportunities", "reason" : "As you develop your skills and prove yourself, you'll be given the opportunity to move into other parts of the HubSpot Engineering organization.  Depending on your interests, NOC Engineering can be a starting place for roles in Software Development, Site Reliability Engineering, or Technical Operations." }
{ "_id" : { "$oid" : "52014558116a1468585641d4" }, "name" : "Boston's best corporate culture", "reason" : "Driven by our <a href='http://culturecode.com/' target='_new'>CultureCode</a>, HubSpot has a well-deserved reputation as one of the best places to work in the state, and across the country.  We've been recognized as one of the best employers to work for in Massachusetts for four years running." }
{ "_id" : { "$oid" : "520146d1116a1468585641d5" }, "name" : "Fun!", "reason" : "We believe in working hard, and building exceptional products, but we also believe that everyone should take the time to have some fun.  Whether it's a gathering on <a href='http://dev.hubspot.com/blog/jerry-remys-rooftop' target='_new'>Jerry Remy's rooftop</a>, or <a href='http://dev.hubspot.com/blog/product-team-playing-dodgeball' target='_new'>taking out coworkers while eating falafel</a>, we make sure that we give ourselves time away from the screen.", "imageURL" : "http://dev.hubspot.com/hs-fs/hub/51294/file-207939024-jpg/rooftopblog.jpg" }
{ "_id" : { "$oid" : "520149f4116a1468585641d6" }, "name" : "Getting in on the ground-floor", "reason" : "Besides benefits and a competitive salary, you'll be compensated with pre-IPO stock in one of the fastest growing companies in Boston." }
